app/views/static_pages/users.html.erb

SELECT "users".* FROM "users"
---
    <h2>Our Users</h2>
    <% @users = User.all %>