app/views/events/_form.html.erb

    <h2>Our Activities</h2>
      <% @activities = Activity.all %>
---
SELECT "activities".* FROM "activities" ORDER BY title