app/views/events/event.html.erb

		<h4 class="activityquestion">What would you like to do? <span class="smaller">Click an activity to choose.</span></h4>
		<% @activities = Activity.all %>
---
SELECT "activities".* FROM "activities"