app/views/events/index.html.erb


<% @activity = Activity.find(params[:id]) %>
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = 1 LIMIT 1