app/views/events/show.html.erb

SELECT "activities".* FROM "activities" WHERE "activities"."id" = 1 LIMIT 1
---
<p id="notice"><%= notice %></p>
<% @activity = Activity.find(params[:id]) %>