app/controllers/events_controller.rb

SELECT "events".* FROM "events"
SELECT "activities".* FROM "activities" WHERE "activities"."id" = 1 LIMIT 1
---
  def index
    @events = Event.all
    @activity = Activity.find(params[:id])

INSERT INTO "events" ("activity_id", "created_at", "creator_id", "date", "updated_at") VALUES (?, ?, ?, ?, ?)  [["activity_id", 8], ["created_at", Thu, 13 Sep 2012 02:16:48 UTC +00:00], ["creator_id", nil], ["date", Sat, 15 Sep 2012], ["updated_at", Thu, 13 Sep 2012 02:16:48 UTC +00:00]]
---
  def create
    @event = Event.new(params[:event])
    @creator = current_user

    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "events" SET "date" = '2012-09-29', "updated_at" = '2012-09-14 20:59:19.392302' WHERE "events"."id" = 2
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])